In [7]:
# read data in directly from GitHub in raw version

import pandas as pd
edu = pd.read_csv('https://raw.githubusercontent.com/MQCOMP257/introduction-datascience-python-book/master/files/ch02/educ_figdp_1_Data.csv',
                 na_values = ':',
                 usecols = ["TIME", "GEO", "Value"])

In [10]:
# show dataframe

edu

     TIME                            GEO  Value
0    2000  European Union (28 countries)    NaN
1    2001  European Union (28 countries)    NaN
2    2002  European Union (28 countries)   5.00
3    2003  European Union (28 countries)   5.03
4    2004  European Union (28 countries)   4.95
..    ...                            ...    ...
379  2007                        Finland   5.90
380  2008                        Finland   6.10
381  2009                        Finland   6.81
382  2010                        Finland   6.85
383  2011                        Finland   6.76

[384 rows x 3 columns]

In [12]:
# show first five rows only

edu.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

In [13]:
# show last five rows only

edu.tail()

     TIME      GEO  Value
379  2007  Finland   5.90
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

In [14]:
# show statistical summary of numeric columns

edu.describe()

              TIME       Value
count   384.000000  361.000000
mean   2005.500000    5.203989
std       3.456556    1.021694
min    2000.000000    2.880000
25%    2002.750000    4.620000
50%    2005.500000    5.060000
75%    2008.250000    5.660000
max    2011.000000    8.810000

In [15]:
# display the column names

edu.columns

Index(['TIME', 'GEO', 'Value'], dtype='object')

In [17]:
# display the indexes

edu.index

RangeIndex(start=0, stop=384, step=1)

In [18]:
# retrieve values of dataframe as a Python array

edu.values

array([[2000, 'European Union (28 countries)', nan],
       [2001, 'European Union (28 countries)', nan],
       [2002, 'European Union (28 countries)', 5.0],
       ...,
       [2009, 'Finland', 6.81],
       [2010, 'Finland', 6.85],
       [2011, 'Finland', 6.76]], dtype=object)